/**
 * メール本文の定数クラス
 */
export class MailTextConst {

  /** ユーザー登録メール：本文 */
  static readonly TEXT_CREATE_USER = '*** 本メールにお心当たりがない場合は破棄ください。 ***' +
                                     '\n' +
                                     '\n' +
                                     'この度はPersonal Sports History をご利用いただき、ありがとうございます。' +
                                     '\n' +
                                     'お客さまのメールアドレスの入力を受け付けました。以下URLから次のステップへお進みください。' +
                                     '\n' +
                                     '\n' +
                                     '※1' +
                                     '\n' +
                                     '\n' +
                                     'お手数ですが、こちらのリンクをクリックしても機能しない場合は、URLをコピーして新しいブラウザウィンドウに貼り付けてください。' +
                                     '\n' +
                                     '\n' +
                                     '登録完了後に、改めて登録完了の確認メールをお送りいたします。' +
                                     '\n' +
                                     '\n' +
                                     '━━━━━━━━━━━━━━━━━━━' +
                                     '\n' +
                                     '\n' +
                                     '株式会社べスタッフ' +
                                     '\n' +
                                     'https://www.bestaff.co.jp' +
                                     '\n' +
                                     '\n' +
                                     '※本メールは送信専用です。' +
                                     '\n' +
                                     '\n' +
                                     '━━━━━━━━━━━━━━━━━━━';

  /** ユーザー登録完了メール：本文 */
  static readonly TEXT_CREATE_USER_COMP = 'Personal Sports Historyへのご登録、ありがとうございます。' +
                                          '\n' +
                                          '本メールをもって、登録完了となります。' +
                                          '\n' +
                                          '\n' +
                                          '引き続き、操作される場合は以下のURLよりログインください。' +
                                          '\n' +
                                          '\n' +
                                          '※1' +
                                          '\n' +
                                          '\n' +
                                          'お手数ですが、こちらのリンクをクリックしても機能しない場合は、URL をコピーして新しいブラウザウィンドウに貼り付けてください。' +
                                          '\n' +
                                          '\n' +
                                          '登録されたメールアドレスとパスワードは、ログイン時に必要となりますので、大切に管理してください。' +
                                          '\n' +
                                          '\n' +
                                          '━━━━━━━━━━━━━━━━━━━' +
                                          '\n' +
                                          '\n' +
                                          '株式会社べスタッフ' +
                                          '\n' +
                                          'https://www.bestaff.co.jp' +
                                          '\n' +
                                          '\n' +
                                          '※本メールは送信専用です。' +
                                          '\n' +
                                          '\n' +
                                          '━━━━━━━━━━━━━━━━━━━';

  /** パスワードリセットメール：本文 */
  static readonly TEXT_PASSWORD_RESET = 'Personal Sports Historyのアカウントパスワードをリセットするには次のリンクをクリックしてください。' +
                                        '\n' +
                                        '\n' +
                                        '※1' +
                                        '\n' +
                                        '\n' +
                                        'お手数ですが、こちらのリンクをクリックしても機能しない場合は、URL をコピーして新しいブラウザウィンドウに貼り付けてください。' +
                                        '\n' +
                                        '本メールにお心当たりがない場合は破棄していただけますと幸いです。' +
                                        '\n' +
                                        '\n' +
                                        '━━━━━━━━━━━━━━━━━━━' +
                                        '\n' +
                                        '\n' +
                                        '株式会社べスタッフ' +
                                        '\n' +
                                        'https://www.bestaff.co.jp' +
                                        '\n' +
                                        '\n' +
                                        '※本メールは送信専用です。' +
                                        '\n' +
                                        '\n' +
                                        '━━━━━━━━━━━━━━━━━━━';

  /** 認証コード送信メール：本文 */
  static readonly TEXT_SEND_AUTH_CODE = '登録されているメールアドレスを変更する為の認証コードをお送りいたします。' +
                                        '\n' +
                                        '\n' +
                                        '※1' +
                                        '\n' +
                                        '\n' +
                                        '認証コード入力画面でこちらのコードを入力してください。' +
                                        '\n' +
                                        '\n' +
                                        '※認証コードの有効期限は※2分です。' +
                                        '\n' +
                                        '\n' +
                                        '本メールにお心当たりがない場合は破棄していただけますと幸いです。' +
                                        '\n' +
                                        '\n' +
                                        '━━━━━━━━━━━━━━━━━━━' +
                                        '\n' +
                                        '\n' +
                                        '株式会社べスタッフ' +
                                        '\n' +
                                        'https://www.bestaff.co.jp' +
                                        '\n' +
                                        '\n' +
                                        '※本メールは送信専用です。' +
                                        '\n' +
                                        '\n' +
                                        '━━━━━━━━━━━━━━━━━━━';
}
